InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омНастройкаПовтор/Ext/Module.bsl
Функция ПолучитьСтадиюСогласовано() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияСогласовано());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()       

Функция ПолучитьСтадиюСогласования() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияСогласование());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()       

Функция ПолучитьСтадиюТЗ() Экспорт
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияТЗ());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()

Функция ПолучитьСтадиюПодтвержденияТЗ() Экспорт
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляСтадияПодтвержденияТЗ());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	
КонецФункции // ПолучитьСтадиюСогласования()

Функция ПолучитьСтадиюОкончанияПроизводства() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиОжиданиеПроизводства());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	

КонецФункции // ПолучитьСтадиюОкончанияПроизводства()

Функция ПолучитьСтадиюНаСкладе() Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиХранениеНаСкладе());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.СтадииКомплекта.ПустаяСсылка();
	

КонецФункции // ПолучитьСтадиюНаСкладе()
